raidlist = {
        'Бобовая граната': 6,
        'Связка боб. гранат': 2,
        'Разрывной патрон': 20,
        'C4': 1,
        'Ракета': 1,
        'Каменный патрон': 45
    }

reslist = {
        'Бобовая граната' : {
        'Сера': 120,
        'Уголь': 180,
        'Металл': 20
},
        'Связка боб. гранат' : {
        'Сера': 480,
        'Уголь': 720,
        'Металл': 80,
        'Ткань': 10,
        'Веревка': 1
},
        'Разрывной патрон' : {
        'Сера': 50,
        'Уголь': 60,
        'Металл': 10
},
        'C4' : {
        'Сера': 2200,
        'Уголь': 3000,
        'Металл': 200,
        'Ткань': 20,
        'Жир': 45,
        'Микросхемы': 2
},
        'Ракета': {
        'Сера': 1400,
        'Уголь': 1950,
        'Металл': 100,
        'Ткань': 8,
        'Жир': 24,
        'Трубы': 2
},
        'Каменный патрон': {
        'Сера': 20,
        'Уголь': 30,
        'Камень': 5
}

}

