
door = {
        'Дерево': {
        'Бобовая граната': 6,
        'Связка боб. гранат': 2,
        'Разрывной патрон': 20,
        'C4': 1,
        'Ракета': 1,
        'Каменный патрон': 45
        },
        'Металл': {
        'Бобовая граната': 18,
        'Связка боб. гранат': 4,
        'Разрывной патрон': 63,
        'C4': 1,
        'Ракета': 2
        },
        'МВК': {
        'Бобовая граната': 69,
        'Связка боб. гранат': 15,
        'Разрывной патрон': 250,
        'C4': 3,
        'Ракета': 5
        }
    }


window = {
        'Дерево': {
        'Бобовая граната': 13,
        'Связка боб. гранат': 3,
        'Разрывной патрон': 56,
        'C4': 1,
        'Ракета': 2
        },
        'Металл': {
        'Бобовая граната': 56,
        'Связка боб. гранат': 12,
        'Разрывной патрон': 200,
        'C4': 2,
        'Ракета': 4
        },
        'МВК': {
        'Бобовая граната': 84,
        'Связка боб. гранат': 18,
        'Разрывной патрон': 300,
        'C4': 3,
        'Ракета': 6
        }
    }



wall = {
        'Дерево': {
        'Бобовая граната': 13,
        'Связка боб. гранат': 3,
        'Разрывной патрон': 56,
        'C4': 1,
        'Ракета': 2
        },
        'Камень': {
        'Бобовая граната': 46,
        'Связка боб. гранат': 10,
        'Разрывной патрон': 200,
        'C4': 2,
        'Ракета': 4
        },
        'Металл': {
        'Бобовая граната': 112,
        'Связка боб. гранат': 23,
        'Разрывной патрон': 400,
        'C4': 4,
        'Ракета': 8
        },
        'МВК': {
        'Бобовая граната': 223,
        'Связка боб. гранат': 46,
        'Разрывной патрон': 800,
        'C4': 8,
        'Ракета': 15
        }
    }


garage = {
        'Бобовая граната': 42,
        'Связка боб. гранат': 9,
        'Разрывной патрон': 150,
        'C4': 2,
        'Ракета': 3
}



big_wall = {
        'Дерево': {
        'Бобовая граната': 26,
        'Связка боб. гранат': 6,
        'Разрывной патрон': 98,
        'C4': 2,
        'Ракета': 3
        },
        'Камень': {
        'Бобовая граната': 46,
        'Связка боб. гранат': 10,
        'Разрывной патрон': 185,
        'C4': 2,
        'Ракета': 4
        }
}



reslist = {
        'Бобовая граната' : {
        'Сера': 120,
        'Уголь': 180,
        'Металл': 20
},
        'Связка боб. гранат' : {
        'Сера': 480,
        'Уголь': 720,
        'Металл': 80,
        'Ткань': 10,
        'Веревка': 1
},
        'Разрывной патрон' : {
        'Сера': 50,
        'Уголь': 60,
        'Металл': 10
},
        'C4' : {
        'Сера': 2200,
        'Уголь': 3000,
        'Металл': 200,
        'Ткань': 20,
        'Жир': 45,
        'Микросхемы': 2
},
        'Ракета': {
        'Сера': 1400,
        'Уголь': 1950,
        'Металл': 100,
        'Ткань': 8,
        'Жир': 24,
        'Трубы': 2
},
        'Каменный патрон': {
        'Сера': 20,
        'Уголь': 30,
        'Камень': 5
}

}

